florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// =============================================================================
// ESP32-S3 HMI Firmware — CAN Bring-Up + TFT Display
//
// Framework:  Arduino (C++17)
// Board:      ESP32-S3-DevKitC-1
// Display:    480×320 TFT via TFT_eSPI (ST7796, landscape rotation 1)
// Reference:  docs/CAN_CONTRACT_FINAL.md rev 1.3
//             docs/HMI_RENDERING_STRATEGY.md
// =============================================================================

#include <Arduino.h>
#include <climits>

#include <esp_system.h>
#include <esp_idf_version.h>
#include <freertos/semphr.h>
#include <freertos/queue.h>
#include <ESP32-TWAI-CAN.hpp>
#include <driver/twai.h>
#include <TFT_eSPI.h>
#include "can_ids.h"
#include "can_rx.h"
#include "vehicle_data.h"
#include "screen_manager.h"
#include "ui/runtime_monitor.h"
#include "ui/debug_overlay.h"
#include "ui/led_toggle.h"
#include "ui/mode_icons.h"
#include "sensors/obstacle_sensor.h"
#include "can/can_obstacle.h"
#include "led_controller.h"
#include "power_manager.h"
#include "audio_manager.h"
#include "shifter_input.h"
#include "remote_control.h"
#include "touch_handler.h"
#include "touch_calibration.h"
#include "config_store.h"
#include "traction_switch.h"
#include "mode_sync.h"
#include "display_backlight.h"
#include "stm32_liveness.h"
#include "twai_recovery.h"
#include "boot_diag.h"

// =============================================================================
// PSRAM Diagnostic — Verifica que la PSRAM OPI de 8MB está activa y funcional
// =============================================================================
static void psram_diagnostic() {
    Serial.println("=== PSRAM DIAGNOSTIC ===");

    if (psramInit()) {
        Serial.println("PSRAM OK: inicializada correctamente");
    } else {
        Serial.println("PSRAM ERROR: no detectada o fallo de inicialización");
        return;
    }

    size_t total = ESP.getPsramSize();
    size_t libre = ESP.getFreePsram();

    Serial.printf("PSRAM total: %u bytes\n", (unsigned)total);
    Serial.printf("PSRAM libre: %u bytes\n", (unsigned)libre);

    // Reservar la mitad de la PSRAM disponible (seguro para N16R8: 8MB)
    size_t testSize = total / 2;
    uint8_t* block = (uint8_t*) ps_malloc(testSize);

    if (block) {
        Serial.printf("PSRAM TEST: asignación de %u bytes OK\n", (unsigned)testSize);
        free(block);
    } else {
        Serial.printf("PSRAM TEST: fallo asignando %u bytes\n", (unsigned)testSize);
    }

    Serial.println("==========================");
}

// =============================================================================
// Runtime Overlay — Muestra PSRAM, RAM, FPS y tiempo de render en pantalla
// =============================================================================
static void draw_runtime_overlay(TFT_eSPI& tft, uint32_t frameTimeMs) {
    // Fondo semitransparente
    tft.fillRect(0, 0, 160, 60, TFT_BLACK);

    // PSRAM y RAM — stack-only formatting (no heap String class)
    char line[32];
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setTextSize(1);
    tft.setTextDatum(TL_DATUM);

    snprintf(line, sizeof(line), "PSRAM: %u KB",
             (unsigned)(ESP.getFreePsram() / 1024));
    tft.drawString(line, 4, 4);

    snprintf(line, sizeof(line), "RAM:   %u KB",
             (unsigned)(ESP.getFreeHeap() / 1024));
    tft.drawString(line, 4, 20);

    // FPS y tiempo de render
    uint32_t fps = frameTimeMs > 0 ? 1000 / frameTimeMs : 0;
    snprintf(line, sizeof(line), "FPS: %lu", (unsigned long)fps);
    tft.drawString(line, 4, 36);
}

// CAN transceiver pins (TJA1051T/3, 3.3V logic with VIO=3.3V)
static constexpr int CAN_TX_PIN = 4;
static constexpr int CAN_RX_PIN = 5;

// Global TFT instance — used by all screens via extern
TFT_eSPI tft = TFT_eSPI();

static vehicle::VehicleData vehicleData;
static ScreenManager screenManager;

static uint8_t  heartbeatCounter = 0;
static unsigned long lastHeartbeatMs  = 0;
static unsigned long lastSerialMs     = 0;
static unsigned long lastCanDiagMs    = 0;   // TWAI bus diagnostic interval
static unsigned long lastBusOffCheckMs = 0;  // TWAI bus-off recovery check
// TWAI BUS_OFF recovery — stable-heartbeat policy (pure, host-tested module).
// Recovery is confirmed ONLY after sustained advancing STM32 heartbeats; the
// controller merely reporting RUNNING is treated as probation, never as
// healthy.  Preserves the lifetime BUS_OFF count and retries fast-then-slow so
// the node always recovers after a physical reconnection.
static twai_recovery::TwaiBusOffRecovery g_twaiRecovery;

/* Error-passive recovery state.
 * When TEC reaches 128 the TWAI controller enters error-passive but keeps
 * state = RUNNING — the existing bus-off recovery never fires.  If the
 * condition persists for ERROR_PASSIVE_TIMEOUT_MS we do a full driver
 * reinit (stop → uninstall → install → start) to clear error counters.
 *
 * Two-phase strategy:
 *   Phase 1 (fast):  up to ERROR_PASSIVE_MAX_FAST attempts every 3 s.
 *   Phase 2 (slow):  unlimited attempts every 30 s — avoids hammering the
 *                     bus while still recovering if the remote node (STM32)
 *                     comes online later. */
static constexpr uint32_t ERROR_PASSIVE_TIMEOUT_MS      = 3000;   // fast-phase interval
static constexpr uint32_t ERROR_PASSIVE_SLOW_TIMEOUT_MS = 30000;  // slow-phase interval
static constexpr uint8_t  ERROR_PASSIVE_MAX_FAST        = 10;     // fast-phase attempts
static unsigned long errorPassiveSince  = 0;  // 0 = not in error-passive
static uint8_t       errorPassiveResets = 0;
#if RUNTIME_MONITOR
static unsigned long lastRtMonMs      = 0;
#endif

// ---- LED relay state tracking ----
static bool     frontLedLocalState = false;  // front LED relay desired state
static bool     rearLedLocalState  = false;  // rear LED relay desired state
// One-shot NVS relay restore after boot (retries until the STM32 echoes the
// desired relay state, so a dropped CMD_LED frame can't leave the strips off).
static bool          ledBootRestoreDone     = false;
static uint8_t       ledBootRestoreAttempts = 0;
static unsigned long ledBootRestoreLastMs   = 0;
static constexpr uint8_t       LED_BOOT_RESTORE_MAX_ATTEMPTS = 10;
static constexpr unsigned long LED_BOOT_RESTORE_RETRY_MS     = 500;

