florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// ---- NVS flush interval ----
static unsigned long lastNvsFlushMs = 0;
static constexpr unsigned long NVS_FLUSH_INTERVAL_MS = 10000;  // 10 seconds

// ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
// Detect whether the STM32 alive counter (heartbeat byte 0) is actually
// incrementing.  A frozen STM32 (IWDG not kicking, or timer firing without
// the main loop running) would keep sending the same counter value.
// After STM32_HB_FREEZE_COUNT consecutive identical counter values the ESP32
// considers the STM32 non-responsive and inhibits further motion commands.
static constexpr uint8_t  STM32_HB_FREEZE_COUNT = 5;   // 5 × HEARTBEAT_INTERVAL_MS (see STM32_HB_FREEZE_TIME_MS below)
// Tie the freeze-detection window to the heartbeat period at compile time so
// that changing one constant cannot silently desynchronise the other.
static constexpr uint32_t STM32_HB_FREEZE_TIME_MS =
    (uint32_t)STM32_HB_FREEZE_COUNT * can::HEARTBEAT_INTERVAL_MS;
static_assert(STM32_HB_FREEZE_TIME_MS < can::CAN_LOSS_TIMEOUT_MS,
              "STM32 freeze detection must trigger before CAN-loss timeout");
// Absence timeout: if no NEW heartbeat frame arrives within this window the
// STM32 is treated as not-alive independently of the counter value.  Kept
// below CAN_LOSS_TIMEOUT_MS so the dedicated CAN-loss error screen still wins.
static constexpr uint32_t STM32_HB_ABSENCE_TIMEOUT_MS = STM32_HB_FREEZE_TIME_MS;
static Stm32Liveness stm32Liveness(STM32_HB_FREEZE_COUNT, STM32_HB_ABSENCE_TIMEOUT_MS);
// Rate-limit the "frozen" warning so a stuck STM32 cannot spam Serial.
static unsigned long stm32FrozenWarnLastMs = 0;
static constexpr unsigned long STM32_FROZEN_WARN_INTERVAL_MS = 1000;
static bool     stm32IsAlive         = false;

// ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
// When the STM32 restarts it re-initialises to GEAR_FORWARD regardless of
// what gear the ESP32 (or driver) had selected.  The ESP32 detects the restart
// via the startup_inhibit bit (bit 0 of heartbeat statusFlags) transitioning
// from 0→1, sets a flag, and re-sends the current physical shifter gear as soon
// as the inhibit clears and the STM32 enters ACTIVE state.
static bool     stm32StartupSeen     = false;  // true while startup_inhibit was last 1
static bool     gearResyncPending    = false;  // true = need to re-send gear on ACTIVE
static bool     tempMapResyncPending = false;  // true = need to re-send DS18B20 map after STM32 restart

// ---- Render task (Core 0) — offloads TFT + touch from main loop ----
static SemaphoreHandle_t vdMutex = nullptr;
static vehicle::VehicleData renderVD;  // shared copy for render task
static QueueHandle_t touchActionQueue = nullptr;
// R-3 hardening: capture the render task handle so loop() can query
// its stack high-watermark via uxTaskGetStackHighWaterMark().  Was
// previously discarded (nullptr passed as 6th arg of xTaskCreate*).
static TaskHandle_t renderTaskHandle = nullptr;

enum class TouchAction : uint8_t {
    FRONT_LED_TOGGLE,
    REAR_LED_TOGGLE,
    TANK_MODE_TOGGLE,
};

// ---- Command ACK tracking (Phase 13) ----
// Non-blocking: records when a command was sent and checks for ACK arrival.
// UI state is only updated once ACK is received or timeout expires.
// Design: no automatic retry — bounded timeout only, no infinite loops.

static bool     ackPending     = false;   // true while waiting for ACK
static uint8_t  ackExpectedCmd = 0;       // low byte of the command CAN ID we sent
static unsigned long ackSentMs = 0;       // timestamp when the command was sent
static bool     ackTimedOut    = false;   // set true if ACK_TIMEOUT_MS elapsed

/// Call before sending a command that expects ACK (CMD_MODE, SERVICE_CMD).
__attribute__((unused))
static void ackBeginWait(uint8_t cmdIdLow) {
    ackPending     = true;
    ackExpectedCmd = cmdIdLow;
    ackSentMs      = millis();
    ackTimedOut    = false;
}

/// Call from loop() after can_rx::poll() to check for ACK arrival or timeout.
static void ackCheck(vehicle::VehicleData& data) {
    if (!ackPending) return;

    // Check if matching ACK arrived
    const auto& ad = data.ack();
    if (ad.timestampMs >= ackSentMs && ad.cmdIdLow == ackExpectedCmd) {
        ackPending  = false;
        ackTimedOut = false;
        if (ad.result != can::AckResult::OK) {
            Serial.printf("[ACK] cmd 0x%02X result=%u state=%u\n",
                          ad.cmdIdLow, static_cast<uint8_t>(ad.result),
                          static_cast<uint8_t>(ad.systemState));
        }
        return;
    }

    // Check timeout (bounded, no retry loop)
    if (millis() - ackSentMs >= can::ACK_TIMEOUT_MS) {
        ackPending  = false;
        ackTimedOut = true;
        data.setAckTimeout(millis());
        Serial.printf("[ACK] TIMEOUT waiting for cmd 0x%02X\n", ackExpectedCmd);
    }
}

/// Send LED relay command to STM32 via CAN 0x120.
/// @param front  true = turn on front relay, false = turn off
/// @param rear   true = turn on rear relay,  false = turn off
static void sendLedCommand(bool front, bool rear) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_LED;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = front ? 1 : 0;
    frame.data[1]          = rear  ? 1 : 0;
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_LED & 0xFF);  // Low byte of 0x120 = 0x20
}

/// Send pre-power-cut safe-state request to STM32 via CAN 0x130.
/// Called once on entry to SHUTTING_DOWN, before the external delay
/// relay physically removes power.  The STM32 reuses existing primitives
/// (Traction_EmergencyStop / Steering_Neutralize / Relay_PowerDown) to
/// force PWM=0, EN=LOW, relays OFF.  No ACK is expected.  If the frame
/// is lost on the bus, behaviour is unchanged — the hardware delay
/// relay still cuts power exactly as before.
static void sendSystemShutdown() {
    CanFrame frame = {};
    frame.identifier       = can::CMD_SYSTEM_SHUTDOWN;
    frame.extd             = 0;
    frame.data_length_code = 0;     // Empty payload (STM32 ignores any byte)
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
}

