florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Initialize WS2812B LED controller (front GPIO 47 + rear GPIO 48)
    led_ctrl::init();

    // Initialize power manager (ignition key on GPIO 40/41)
    power_mgr::init();

    // Initialize DFPlayer audio (UART2 on GPIO 43/44)
    audio::init();

    // Initialize MCP23017 shifter input (I2C on GPIO 8/9)
    shifter::init();

    // Initialize remote control parser (FlySky FS-iA6B iBUS, GPIO 16 RX).
    // Enabled by default (REMOTE_CONTROL_ENABLED=1 in platformio.ini);
    // compiles to an inline no-op when the flag is set to 0.  See
    // docs/REMOTE_CONTROL_IMPLEMENTATION_PLAN.md Phase 2.
    remote_control::init();

    // Initialize traction switch (DPDT rocker on GPIO 15)
    traction_sw::init();

    // Initialize centralized touch handler
    touch::init();

    // Apply saved configuration
    {
        const auto& cfg = config_store::get();
        // Traction mode is now read from physical switch, not NVS
        currentModeFlags   = traction_sw::getModeFlag()
                           | (cfg.driveMode & can::MODE_FLAG_TANK_TURN);
        frontLedLocalState = cfg.frontLedEnabled;
        rearLedLocalState  = cfg.rearLedEnabled;

        // Apply saved audio volume to DFPlayer
        audio::setVolume(cfg.audioVolume);
        lastAppliedAudioVolume = cfg.audioVolume;

        // Restore saved LED decorative mode
        led_ctrl::setDecorMode(static_cast<led_ctrl::DecorMode>(cfg.ledMode));

        // Populate vehicleData with initial mode flags
        vehicle::ModeData md;
        md.modeFlags   = currentModeFlags;
        md.timestampMs = millis();
        vehicleData.setMode(md);
    }

    // Create render task on Core 0 — offloads all TFT and touch operations
    // from the main loop, preventing SPI blocking on Core 1.
    vdMutex = xSemaphoreCreateMutex();
    touchActionQueue = xQueueCreate(8, sizeof(TouchAction));
    if (vdMutex == nullptr || touchActionQueue == nullptr) {
        Serial.println("[BOOT][ERR] Failed to create render task resources");
        // Fall through — render task won't be created, TFT won't update.
        // System is still safe (CAN, safety, LEDs continue on Core 1).
    } else {
        BaseType_t rc = xTaskCreatePinnedToCore(
            renderTask, "Render", 16384, nullptr, 1, &renderTaskHandle, 0);
        if (rc != pdPASS) {
            Serial.println("[BOOT][ERR] Failed to create render task");
        } else {
            Serial.println("[BOOT][INFO] Render task started on Core 0");
        }
    }

    // Boot-diagnostics telemetry — single machine-parseable line emitted once
    // per boot on the serial channel (the ESP32 HMI is CAN receive-only, so it
    // has no diagnostic-frame TX path).  Captures the reset cause plus the heap
    // low-water mark and both task stack high-watermarks so brownouts, panics,
    // watchdog resets, heap exhaustion and stack pressure are all observable
    // from the boot log.  Formatting/classification lives in the host-tested
    // boot_diag module; this is pure instrumentation.
    {
        boot_diag::HeapStats hs;
        hs.freeNow      = (uint32_t)esp_get_free_heap_size();
        hs.minFreeEver  = (uint32_t)esp_get_minimum_free_heap_size();
        hs.totalSize    = (uint32_t)ESP.getHeapSize();
        hs.largestBlock = (uint32_t)ESP.getMaxAllocHeap();
        uint32_t loopHwm   = (uint32_t)uxTaskGetStackHighWaterMark(nullptr);
        uint32_t renderHwm = (renderTaskHandle != nullptr)
                           ? (uint32_t)uxTaskGetStackHighWaterMark(renderTaskHandle)
                           : 0u;
        char bootLine[192];
        boot_diag::format(bootLine, sizeof(bootLine), bootRc, hs, loopHwm, renderHwm);
        Serial.println(bootLine);
    }
}

// ---------------------------------------------------------------------------
// loop() — called repeatedly
// ---------------------------------------------------------------------------
void loop() {
    RTMON_LOOP_BEGIN();
    unsigned long now = millis();

    // R-3 hardening: emit stack high-watermark for both FreeRTOS tasks
    // every 5 s.  Pure instrumentation — uxTaskGetStackHighWaterMark
    // is non-blocking and reports the minimum free stack (in words on
    // ESP-IDF FreeRTOS) seen since task creation.  No stack sizes are
    // changed; this only makes silent overflow risk observable.
    {
        static uint32_t s_lastStackHwmLogMs = 0;
        if ((now - s_lastStackHwmLogMs) >= 5000UL) {
            s_lastStackHwmLogMs = now;
            UBaseType_t loopHwm   = uxTaskGetStackHighWaterMark(nullptr);
            UBaseType_t renderHwm = (renderTaskHandle != nullptr)
                                  ? uxTaskGetStackHighWaterMark(renderTaskHandle)
                                  : 0;
            Serial.printf("[STACK] loop_hwm=%u render_hwm=%u\n",
                          (unsigned)loopHwm, (unsigned)renderHwm);
        }
    }

    // Poll CAN RX and decode incoming frames
    RTMON_CAN_BEGIN();
    can_rx::poll(vehicleData);
    RTMON_CAN_END();

    // Check for pending ACK (non-blocking)
    ackCheck(vehicleData);

    // ---- Sync mode flags from STM32 heartbeat echo ----
    // The STM32 echoes the active mode flags in the heartbeat status_flags
    // (bits 1-2).  This allows the ESP32 to confirm the STM32 actually
    // applied the requested mode, even if the ACK was lost.
    // §1 CAN state validation: this is the SOLE source of truth for UI mode
    // state.  Tank turn and traction toggles only send CAN commands — the UI
    // updates here after the STM32 confirms via heartbeat echo.
    // Guard: only sync after first valid heartbeat has been received
    // (timestampMs is 0 until the first CAN heartbeat is decoded).
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t confirmedFlags = (hb.statusFlags >> 1) & 0x03;
            if (confirmedFlags != currentModeFlags) {
                currentModeFlags = confirmedFlags;
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
                // Persist confirmed tank turn state to NVS
                config_store::setDriveMode(currentModeFlags & can::MODE_FLAG_TANK_TURN);
            }
        }
    }

