florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Poll iBUS parser (no-op only when REMOTE_CONTROL_ENABLED=0) and compute
    // unified LOCAL/REMOTE arbitration gates for all RC-driven subsystems.
    remote_control::update();
    const bool remoteAuthorityActive =
        stm32IsAlive &&
        remote_control::isRemoteSelected() &&
        remote_control::getState() == remote_control::State::ACTIVE;
    const bool remoteMotionAuthorityActive =
        remoteAuthorityActive && !remote_control::isKillSwitchActive();

    // ---- Shifter gear update ----
    // Poll shifter + RC CH7 and send CAN 0x102 on authoritative source change.
    {
        shifter::update();
        uint8_t gear = remoteMotionAuthorityActive
                     ? remote_control::getRequestedGear()
                     : shifter::getGearRaw();
        if (gear != lastSentGear &&
            (now - lastGearSendMs) >= GEAR_SEND_DEBOUNCE_MS &&
            stm32IsAlive) {
            lastSentGear   = gear;
            lastGearSendMs = now;
            sendGearCommand(gear);
            // Play specific gear announcement
            switch (static_cast<shifter::Gear>(gear)) {
                case shifter::Gear::PARK:       audio::play(audio::Sound::GEAR_PARK,    audio::Priority::LO); break;
                case shifter::Gear::REVERSE:    audio::play(audio::Sound::GEAR_REVERSE, audio::Priority::LO); break;
                case shifter::Gear::NEUTRAL:    audio::play(audio::Sound::GEAR_NEUTRAL, audio::Priority::LO); break;
                case shifter::Gear::FORWARD:    audio::play(audio::Sound::GEAR_D1,      audio::Priority::LO); break;
                case shifter::Gear::FORWARD_D2: audio::play(audio::Sound::GEAR_D2,      audio::Priority::LO); break;
            }
            Serial.printf(remoteMotionAuthorityActive // flawfinder: ignore
                              ? "[REMOTE] Gear(CH7) → %u\n"
                              : "[SHIFTER] Gear → %u\n",
                          gear);
        }
    }

    // ---- Traction switch update ----
    // Poll DPDT rocker switch for 2WD/4WD selection.
    // CAN CMD_MODE is sent only when the switch state changes.
    // Speed gate is handled internally by traction_sw::update().
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t swSpeedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            swSpeedSum += vehicleData.speed().raw[i];
        }
        float swSpeedKmh = static_cast<float>(swSpeedSum) / 4.0f * 0.1f;

        traction_sw::update(swSpeedKmh);

        if (remoteMotionAuthorityActive) {
            uint8_t remoteModeFlags = remote_control::getDriveMode();
            if (remoteModeFlags != currentModeFlags && stm32IsAlive) {
                currentModeFlags = remoteModeFlags;
                sendModeCommand(currentModeFlags);
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
                Serial.printf("[REMOTE] Mode(CH6) → flags=0x%02X\n", currentModeFlags);
            }
        } else if (traction_sw::hasChanged() && stm32IsAlive) {
            // Physical 4x4 selector is the SOURCE OF TRUTH.  Latch the
            // debounced selection into the sync FSM; the actual CMD_MODE
            // transmission (heartbeat-gated, ACK + bounded retry) is driven
            // by g_modeSync below instead of a single fire-and-forget send.
            uint8_t tractionBit = traction_sw::getModeFlag();
            currentModeFlags = (currentModeFlags & can::MODE_FLAG_TANK_TURN)
                             | tractionBit;
            g_modeSync.setDesired(currentModeFlags);
            // NVS persist deferred to heartbeat sync (§1) — only confirmed
            // state is persisted to avoid stale data on power loss.
            {
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
            }
            // Play traction audio feedback
            if (traction_sw::is4WD()) {
                audio::play(audio::Sound::TRACTION_4X4, audio::Priority::LO);
            } else {
                audio::play(audio::Sound::TRACTION_4X2, audio::Priority::LO);
            }
            Serial.printf("[TRACTION] Switch → %s, flags=0x%02X\n",
                          traction_sw::is4WD() ? "4WD" : "2WD",
                          currentModeFlags);
            traction_sw::clearChanged();
        }

        // ---- Drive-mode sync FSM tick (physical selector path only) ----
        // Feeds observed CMD_MODE ACKs into the FSM, then advances it: the FSM
        // (re)transmits the selected mode until the STM32 confirms it or the
        // bounded retry budget is exhausted.  Skipped while the remote holds
        // motion authority so the two paths never fight over CMD_MODE.
        if (!remoteMotionAuthorityActive) {
            const auto& ad = vehicleData.ack();
            if (g_modeSync.pending()
                && ad.cmdIdLow == (can::CMD_MODE & 0xFF)
                && ModeSync::ackIsAtOrAfterSend((uint32_t)ad.timestampMs,
                                                (uint32_t)g_modeSendMs)
                && ad.timestampMs != g_lastModeAckTs) {
                g_lastModeAckTs = ad.timestampMs;
                bool ackOk = (ad.result == can::AckResult::OK);
                g_modeSync.onAck(ackOk ? ModeSync::AckResult::OK
                                     : ModeSync::AckResult::REJECTED);
                // [MODESYNC] diagnostic — last ACK + requested/confirmed/retry.
                Serial.printf(
                    "[MODESYNC] ack=%s req=0x%02X conf=0x%02X retries=%u%s\n",
                    ackOk ? "OK" : "REJECT",
                    g_modeSync.desired(), g_modeSync.confirmed(),
                    (unsigned)g_modeSync.retries(),
                    g_modeSync.failed() ? " -> FAILED" : "");
            }
            if (g_modeSync.update(millis(), stm32IsAlive)
                    == ModeSync::Action::SEND) {
                g_modeSendMs = millis();
                sendModeCommand(g_modeSync.sendMode());
                // [MODESYNC] diagnostic — each (re)transmission attempt.
                Serial.printf(
                    "[MODESYNC] send req=0x%02X conf=0x%02X attempt=%u/%u\n",
                    g_modeSync.desired(), g_modeSync.confirmed(),
                    (unsigned)g_modeSync.retries() + 1u,
                    (unsigned)MODE_SYNC_MAX_RETRIES + 1u);
            }
        }
    }

    // ---- Process touch actions from render task (Core 0) ----
    // Touch reading and screen dispatch happen on Core 0 (same SPI bus as TFT).
    // Actions that require CAN sends or state changes are queued here.
    if (touchActionQueue != nullptr) {
        TouchAction act;
        while (xQueueReceive(touchActionQueue, &act, 0) == pdTRUE) {
            switch (act) {
                case TouchAction::FRONT_LED_TOGGLE:
                    if (remoteAuthorityActive) break;
                    frontLedLocalState = !frontLedLocalState;
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    config_store::setFrontLedEnabled(frontLedLocalState);
                    audio::play(frontLedLocalState ? audio::Sound::LIGHTS_ON
                                                   : audio::Sound::LIGHTS_OFF,
                                audio::Priority::LO);
                    Serial.printf("[LED] Front → %s\n",
                                  frontLedLocalState ? "ON" : "OFF");
                    break;

