florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // ---- WS2812B LED update ----
    {
        auto st = vehicleData.heartbeat().systemState;
        bool frontEnabled = vehicleData.lights().frontRelayOn;

        // Enable/disable LED system based on front relay and system state.
        // The front relay controls WS2812B power; when it is OFF (or the user
        // disabled the strips via NVS, reflected in frontRelayOn) the strips
        // stay dark.  BOOT keeps the strips off while the STM32 initialises.
        // STANDBY is intentionally NOT a disable condition: with the front
        // relay ON the driver must see the KITT scanner as soon as the strips
        // are powered, even before the system leaves STANDBY into ACTIVE.
        // (Traction/steering relays and safety are untouched by this.)
        if (!frontEnabled || st == can::SystemState::BOOT) {
            led_ctrl::setEnabled(false);
        } else {
            led_ctrl::setEnabled(true);
        }

        // ---- One-shot emergency flash on ERROR state transition ----
        // When the system enters ERROR (not SAFE — SAFE is a controlled
        // shutdown), fire 3 aggressive red/black flash cycles across both
        // strips to grab the driver's attention.  After the flash completes,
        // the sustained BRAKE_EMERGENCY + HAZARD indication takes over.
        {
            static can::SystemState prevLedState = can::SystemState::BOOT;
            if (st == can::SystemState::ERROR && prevLedState != can::SystemState::ERROR) {
                led_ctrl::startEmergencyFlash(3);
            }
            prevLedState = st;
        }

        // Reverse detection from physical shifter
        bool reverse = (shifter::getGearRaw() == GEAR_REVERSE);

        // Braking & throttle detection: traction average near zero while
        // speed > 0 indicates dynamic braking or throttle release at speed.
        // Regen zone: low throttle (5–20%) at speed — lighter deceleration
        // than full braking, triggers blue-pulse regen indicator on rear.
        bool braking = false;
        bool regen   = false;
        {
            uint32_t trSum = 0;
            for (uint8_t i = 0; i < 4; ++i) {
                trSum += vehicleData.traction().scale[i];
            }
            uint8_t trAvg = static_cast<uint8_t>(trSum / 4);

            uint32_t spSum = 0;
            for (uint8_t i = 0; i < 4; ++i) {
                spSum += vehicleData.speed().raw[i];
            }
            braking = (spSum > LED_SPEED_SUM_THRESHOLD && trAvg <= LED_TRACTION_BRAKING_THRESHOLD);
            regen   = (spSum > LED_SPEED_SUM_THRESHOLD
                       && trAvg > LED_TRACTION_BRAKING_THRESHOLD
                       && trAvg <= LED_TRACTION_REGEN_THRESHOLD);
        }

        // ---- Front LED mode from vehicle state ----
        if (st == can::SystemState::SAFE || st == can::SystemState::ERROR) {
            // Safe Mode: KITT scanner on centre, HAZARD indicators on 4 corners
            led_ctrl::setFrontMode(led_ctrl::FrontMode::KITT_IDLE);
        } else if (st == can::SystemState::LIMP_HOME) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::KITT_IDLE);
        } else if (vehicleData.safety().absActive) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::ABS_ALERT);
        } else if (vehicleData.safety().tcsActive) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::TCS_ALERT);
        } else if (reverse) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::REVERSE);
        } else {
            // NORMAL base: the front strip must ALWAYS show the red KITT /
            // "coche fantástico" scanner.  It must NEVER turn into a
            // rainbow/green pattern from throttle (traction scale) — only the
            // safety states above (ABS/TCS/REVERSE) may override it.
            led_ctrl::setFrontMode(led_ctrl::FrontMode::KITT_IDLE);
        }

        // ---- Rear LED mode from driving state ----
        if (st == can::SystemState::SAFE || st == can::SystemState::ERROR) {
            led_ctrl::setRearMode(led_ctrl::RearMode::BRAKE_EMERGENCY);
        } else if (reverse) {
            led_ctrl::setRearMode(led_ctrl::RearMode::REVERSE);
        } else if (braking) {
            led_ctrl::setRearMode(led_ctrl::RearMode::BRAKE);
        } else if (regen) {
            led_ctrl::setRearMode(led_ctrl::RearMode::REGEN_ACTIVE);
        } else {
            led_ctrl::setRearMode(led_ctrl::RearMode::POSITION);
        }

        // ---- Turn-signal derivation from steering angle (0.1° units) ----
        //
        // ⚠ TURN SIGNAL TIMING & DETERMINISM CONTRACT:
        //
        // This logic is fully deterministic with the following guarantees:
        //   - Runs once per render loop iteration (20 Hz cadence)
        //   - Uses 'now' (millis()) captured once per frame at the top of
        //     the render loop — identical across all consumers
        //   - State transitions: prevTurn, candidateTurn, candidateStartMs
        //     are static locals — no dynamic allocation, no race conditions
        //   - Single-threaded: runs only on Core 0 render task
        //
        // Anti-jitter stack (three independent layers):
        //   1. Hysteresis: 5° dead band (±10° off → ±15° on)
        //      Prevents chatter when steering oscillates near threshold
        //   2. Time filter: new state must persist ≥100 ms (2 frames at 20 Hz)
        //      Prevents micro-oscillation from PWM-coupled steering noise
        //   3. HAZARD override: SAFE/ERROR → immediate hazard (no filter)
        //      Safety-critical indication bypasses all debounce logic
        //
        // Edge oscillation at low speed:
        //   At low speed, steering angle can jitter ±2-5° due to encoder
        //   resolution and motor vibration.  The 5° hysteresis band
        //   (10°→15°) means the signal won't toggle unless the angle
        //   swings by 5°.  The 100 ms persistence filter adds a second
        //   layer: even if the angle briefly crosses 15° and returns,
        //   the turn signal won't activate unless it stays above 15°
        //   for at least 100 ms.
        //
        // Activate at 15° to signal the beginning of a turn.
        // Deactivate at 10° (5° hysteresis) to avoid flickering when the
        // wheel hovers around the threshold.
        // Time filter: a new turn state must persist for ≥100 ms before
        // being applied, preventing rapid left↔right flicker from small
        // steering oscillations at low speed.
        // SAFE/ERROR states override with hazard flash (immediate).
        {
            static constexpr int16_t TURN_ON_RAW  = 150;  // 15.0° — activate
            static constexpr int16_t TURN_OFF_RAW = 100;  // 10.0° — deactivate (hysteresis)
            static constexpr unsigned long TURN_PERSIST_MS = 100;  // anti-jitter time filter

